<template>
    <v-footer
    padless class="justify-end"
    color="#11b8b8">

    <v-tooltip  
    top
    open-delay="200"
    min-width="280"
    color="#11b8b8">
      <template v-slot:activator="{ on, attrs }">
        <v-btn
          color="#11b8b8"
          dark
          elevation="0"
          v-bind="attrs"
          v-on="on"
        >
          KISRA Tracking project | v1.5 (2023/01/05)
        </v-btn>
      </template>

      <v-responsive
        class="overflow-y-auto"
        max-height="400"
        max-width="280">
        <h3>Version</h3>
        <div>
        v1.6 (2023/03/30) <br>
        - เพิ่มการตรวจสอบจำนวนวันลาของพนักงานแต่ละคน<br>
        - เพิ่มการยกเลิกการลาของพนักงานในสถานะ pending <br>
        - เพิ่มการยกเลิกการลาโดยแอดมินหลังจาก approved ไปแล้ว <br>
        - เพิ่มการแสดงวันลาทั้งหมดทีได้ลาไปแล้วของพนักงานที่เลือกในหน้าของ Approval <br>
        v1.5 (2023/01/05) <br>
        - อัปเดต sheet api ปี 2023 <br>
        - แก้ไข Loadingค้าง ในหน้า Approve วันลา <br>
        - แก้ไขการบันทึกข้อมูล sheet ลงวันลาที่อนุมัติแล้ว ถ้าลามากกว่า 1 วัน ให้บันทึกแค่ 1 ครั้ง <br>
        - เพิ่มบันทึกข้อมูล วันที่ลาลงใน sheet ลงวันลาที่อนุมัติแล้ว <br>
        v1.4 (2022/10/22) <br>
        - แสดงเปอร์เซ็นในกราฟแท่ง <br>
        - แบ่งกราฟให้เป็นจำนวนชั่วโมงในการทำงานของโปรเจ็คนั้นๆ <br>
        - เรียงการแสดงกราฟจากมากไปน้อย <br>
        - ลงข้อมูลคนขอลาอนุมัติแล้ว ไปลงใน sheet หน้า ลงวันลาที่อนุมัติแล้ว <br>
        v1.3 (2022/05/25) <br>
        - เพิ่มการเช็ค trcking สำหรับการลา <br>
        - สรุปการ tracking หลังอนุมัติการลา <br>
        v1.2 (2022/05/20) <br>
        - เพิ่มการค้นหาในช่อง employees <br>
        - ปรับข้อมูลการแสดงผลหน้าsummary <br>
        - เพิ่มแบบฟอร์มการลา และหน้าอนุมัติการลา <br>
        - เปลี่ยนช่วงเวลาที่เลือกได้ของกราฟ <br>
        v1.1 (2022/05/09) <br>
        - เพิ่มการคำนวณสัปดาห์สำหรับฟอร์ม <br>
        - เปลี่ยนชื่อใน manu tab และ ชื่อหัวข้อฟอร์ม <br>
        - เปลี่ยน font ใน cornfirm alert <br>
        - เพิ่มวันที่และรายละเอียดของแต่ละversion <br>
        - เปลี่ยนรูปแบบกราฟจากแนวนอนเป็นแนวตั้ง <br>
        - เพิ่มกราฟวงกลมในหน้า summary <br>
        - เพิ่มส่วนผลรวมรายโปรเจคจากกราฟ<br>
        </div>
      </v-responsive>
    </v-tooltip>
    </v-footer>
</template>

<style>

</style>